#!/bin/bash

#-----------------------------------------------
# if文のルール
#-----------------------------------------------
# 1. 数値の比較をする際は、二重の丸括弧で囲う(())

#-----------------------------------------------
# 構文
#-----------------------------------------------
# 構文の例
    if [[条件式1]]; then
        # 条件式1を満たす場合に行う処理
    elif [[条件式2]]; then
        # 条件式1を満たさず, 2を満たす場合に行う処理
    else;
        # いずれの条件も満たさない場合に行う処理
    fi

# 否定形
	if [[ ! 条件式 ]]; then         
	if [[ ! "${num}" -ge 3 ]]; then
	
# 論理和
	if [[ 条件式1 || 条件式2 ]]; then
	if [[ "${num} -ge 3" || "${num} -lt 2" ]]; then

# 論理積
	if [[ 条件式1 && 条件式2 ]]; then
	if [[ "${num} -ge 3" && "${num} -lt 2" ]]; then

# 数値の比較
if (( "${number}" < 100 )); then
  echo "number は 100よりも小さい値です"
fi